export const ModuleList = [{
  value: '其他',
  label: '其他'
},
  {
    value: '立德树人能力体系',
    label: '立德树人能力体系',
    children: [
      {
        value: '师德师风（参加教师工作部认定的相应研修可计2学时）★',
        label: '师德师风（参加教师工作部认定的相应研修可计2学时）★'
      },
      {
        value: '“课程思政”理念与实践★',
        label: '“课程思政”理念与实践★'
      },
      {
        value: '时政解读（国内时事政策、技术发展前沿、重要讲话精神等）',
        label: '时政解读（国内时事政策、技术发展前沿、重要讲话精神等）'
      }
    ]
  },
  {
    value: '教师发展与素养',
    label: '教师发展与素养',
    children: [
      {
        value: '教育学与心理学（获北京市高校教师岗前培训合格证可计2学时）★',
        label: '教育学与心理学（获北京市高校教师岗前培训合格证可计2学时）★'
      },
      {
        value: '教师传播力提升★',
        label: '教师传播力提升★'
      },
      {
        value: '人文素养（心理素质、文学修养、审美品位等）',
        label: '人文素养（心理素质、文学修养、审美品位等）'
      },
      {
        value: '北林文化（北林精神、生态文明建设、北林故事等）',
        label: '北林文化（北林精神、生态文明建设、北林故事等）'
      }
    ]
  },
  {
    value: '教学理念及教学方法',
    label: '教学理念及教学方法',
    children: [
      {
        value: '北林学生剪影',
        label: '北林学生剪影'
      },
      {
        value: '以学生为中心的教学理念',
        label: '以学生为中心的教学理念'
      },
      {
        value: '教学方法与模式（BOPPPS教学法、参与式教学、对分课堂等）',
        label: '教学方法与模式（BOPPPS教学法、参与式教学、对分课堂等）'
      },
      {
        value: '科研反哺人才培养（科研与教学关系、科研平台与共享资源等）',
        label: '科研反哺人才培养（科研与教学关系、科研平台与共享资源等）'
      }
    ]
  },
  {
    value: '教学基本技能',
    label: '教学基本技能',
    children: [
      {
        value: '教学技能专项一：教学设计、课件制作、教学反思等',
        label: '教学技能专项一：教学设计、课件制作、教学反思等'
      },
      {
        value: '教学技能专项二：师生互动、课堂组织与管理等',
        label: '教学技能专项二：师生互动、课堂组织与管理等'
      },
      {
        value: '教学技能专项三：板书、教态、教学语言等',
        label: '教学技能专项三：板书、教态、教学语言等'
      },
    ]
  },
  {
    value: '信息化教学',
    label: '信息化教学',
    children: [
      {
        value: '现代信息技术应用（信息技术与课程整合、智慧教学等）',
        label: '现代信息技术应用（信息技术与课程整合、智慧教学等）'
      },
      {
        value: '基于信息技术的新型教学模式（慕课、混合式教学等）',
        label: '基于信息技术的新型教学模式（慕课、混合式教学等）'
      },
    ]
  },
  {
    value: '教学观摩与演练',
    label: '教学观摩与演练',
    children: [
      {
        value: '教学观摩（示范说课、公开课等）★',
        label: '教学观摩（示范说课、公开课等）★'
      },
      {
        value: '实战演练（微格教学、专家点评辅导等）',
        label: '实战演练（微格教学、专家点评辅导等）'
      },
    ]
  },
  {
    value: '一对一教学咨询',
    label: '一对一教学咨询',
    children: [
      {
        value: '针对具体需求的个性化帮扶',
        label: '针对具体需求的个性化帮扶'
      }
    ]
  },
  {
    value: '校际研讨',
    label: '校际研讨',
    children: [
      {
        value: '参加国内高水平教学能力研修、教学研讨会',
        label: '参加国内高水平教学能力研修、教学研讨会'
      }
    ]
  },
  {
    value: '新绿萌芽',
    label: '新绿萌芽',
    children: [
      {
        value: '新教师教学研习营',
        label: '新教师教学研习营'
      },
      {
        value: '新教师实战训练营',
        label: '新教师实战训练营'
      },
    ]
  },
  {
    value: '青椒成长',
    label: '青椒成长',
    children: [
      {
        value: 'ISW教学技能工作坊',
        label: 'ISW教学技能工作坊'
      },
      {
        value: '教学基本功比赛',
        label: '教学基本功比赛'
      },
      {
        value: '好评课堂研讨会',
        label: '好评课堂研讨会'
      },
      {
        value: '“名师下午茶”',
        label: '“名师下午茶”'
      }
    ]
  },
  {
    value: '卓越发展',
    label: '卓越发展',
    children: [
      {
        value: '教育教学读书分享会',
        label: '教育教学读书分享会'
      },
      {
        value: '教学社群(团队)活动',
        label: '教学社群(团队)活动'
      },
      {
        value: '“院长说”',
        label: '“院长说”'
      },
      {
        value: '“国际慢咖啡”',
        label: '“国际慢咖啡”'
      }
    ]
  },
  {
    value: '在线学习中心',
    label: '在线学习中心',
    children: [
      {
        value: '教师教学在线工具箱',
        label: '教师教学在线工具箱'
      },
      {
        value: '教师在线学习资源库',
        label: '教师在线学习资源库'
      },
    ]
  },
]
export const isMajor = [
  {
    value: 1,
    label: '必修',
  },
  {
    value: 0,
    label: '选修'
  }
]
